Revit 2024 API
SpecUtils Class
 A utility class of functions related to specs. A spec describes a data type that parameters can hold.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static class SpecUtils
Visual Basic
Public NotInheritable Class SpecUtils
Visual C++
public ref class SpecUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpecUtils
See Also
SpecUtils Members
Autodesk.Revit.DB Namespace